pmo-dataset/graphviz/16.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ExclusiveGateway_5" -> "ExclusiveGateway_8";
  "Approve report" -> "Distribute final\nreport";
  "ExclusiveGateway_4" -> "ParallelGateway_1";
  "ParallelGateway_6" -> "Check regulatory\nupdates";
  "Check regulatory\nupdates" -> "ParallelGateway_2";
  "Request\nclarifications of\ndiscrepancies" -> "Receive\nclarifications";
  "Evaluate financial\nrisks" -> "ParallelGateway_3";
  "Prepare financial\nstatements" -> "ParallelGateway_2";
  "ExclusiveGateway_5" -> "Launch detailed\ninvestigation";
  "ParallelGateway_4" -> "ExclusiveGateway_7";
  "Launch detailed\ninvestigation" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "Conduct interviews";
  "ParallelGateway_5" -> "ExclusiveGateway_8";
  "Evaluate operational\nrisks" -> "ParallelGateway_3";
  "ExclusiveGateway_7" -> "Perform site visits";
  "ParallelGateway_6" -> "Prepare financial\nstatements";
  "ParallelGateway_4" -> "Conduct data\nanalysis";
  "Evaluate compliance\nrisks" -> "ParallelGateway_3";
  "Receive\nclarifications" -> "ExclusiveGateway_4";
  "start" -> "Send notification";
  "Gather necessary\ndocuments" -> "ParallelGateway_2";
  "ExclusiveGateway_1" -> "ParallelGateway_5";
  "ParallelGateway_6" -> "Gather necessary\ndocuments";
  "Conduct data\nanalysis" -> "ParallelGateway_5";
  "ExclusiveGateway_7" -> "ExclusiveGateway_1";
  "Conduct interviews" -> "ParallelGateway_5";
  "ExclusiveGateway_3" -> "Approve report";
  "ExclusiveGateway_8" -> "Complete risk\nassessment/mitigatio\nn";
  "ParallelGateway_1" -> "Evaluate financial\nrisks";
  "Send report for\nrevision" -> "Update and resubmit\nreport";
  "ParallelGateway_1" -> "Evaluate compliance\nrisks";
  "ExclusiveGateway_6" -> "Request\nclarifications of\ndiscrepancies";
  "Send notification" -> "ParallelGateway_6";
  "ParallelGateway_1" -> "Evaluate operational\nrisks";
  "Close audit process" -> "end";
  "ExclusiveGateway_6" -> "ExclusiveGateway_4";
  "ParallelGateway_2" -> "Submit documents";
  "Distribute final\nreport" -> "Archive report";
  "ExclusiveGateway_3" -> "Send report for\nrevision";
  "Perform site visits" -> "ExclusiveGateway_1";
  "Archive report" -> "Close audit process";
  "ExclusiveGateway_2" -> "Review report by\naudit director";
  "Review submission" -> "ExclusiveGateway_6";
  "Complete risk\nassessment/mitigatio\nn" -> "Compile audit report";
  "ParallelGateway_3" -> "ExclusiveGateway_5";
  "Review report by\naudit director" -> "ExclusiveGateway_3";
  "Submit documents" -> "Review submission";
  "Compile audit report" -> "ExclusiveGateway_2";
  "Update and resubmit\nreport" -> "ExclusiveGateway_2";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ExclusiveGateway_7" [label="X", shape=diamond];
  "ExclusiveGateway_8" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
  "ParallelGateway_5" [label="+", shape=diamond];
  "ParallelGateway_6" [label="+", shape=diamond];
}
