pmo-dataset/variations/mermaid_with_ids/16.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Submit documents"]
	Task_2["Approve report"]
	Task_3["Archive report"]
	Task_4["Send notification"]
	Task_5["Launch detailed\ninvestigation"]
	Task_6["Close audit process"]
	Task_7["Gather necessary\ndocuments"]
	Task_8["Send report for\nrevision"]
	Task_9["Compile audit report"]
	Task_10["Conduct interviews"]
	Task_11["Check regulatory\nupdates"]
	Task_12["Update and resubmit\nreport"]
	Task_13["Evaluate compliance\nrisks"]
	Task_14["Evaluate financial\nrisks"]
	Task_15["Review submission"]
	Task_16["Receive\nclarifications"]
	Task_17["Prepare financial\nstatements"]
	Task_18["Complete risk\nassessment/mitigatio\nn"]
	Task_19["Perform site visits"]
	Task_20["Review report by\naudit director"]
	Task_21["Distribute final\nreport"]
	Task_22["Conduct data\nanalysis"]
	Task_23["Request\nclarifications of\ndiscrepancies"]
	Task_24["Evaluate operational\nrisks"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ExclusiveGateway_5{"X"}
	ExclusiveGateway_6{"X"}
	ExclusiveGateway_7{"X"}
	ExclusiveGateway_8{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}
	ParallelGateway_4{"+"}
	ParallelGateway_5{"+"}
	ParallelGateway_6{"+"}

	ExclusiveGateway_5 --> ExclusiveGateway_8
	Task_2 --> Task_21
	ExclusiveGateway_4 --> ParallelGateway_1
	ParallelGateway_6 --> Task_11
	Task_11 --> ParallelGateway_2
	Task_23 --> Task_16
	Task_14 --> ParallelGateway_3
	Task_17 --> ParallelGateway_2
	ExclusiveGateway_5 --> Task_5
	ParallelGateway_4 --> ExclusiveGateway_7
	Task_5 --> ParallelGateway_4
	ParallelGateway_4 --> Task_10
	ParallelGateway_5 --> ExclusiveGateway_8
	Task_24 --> ParallelGateway_3
	ExclusiveGateway_7 --> Task_19
	ParallelGateway_6 --> Task_17
	ParallelGateway_4 --> Task_22
	Task_13 --> ParallelGateway_3
	Task_16 --> ExclusiveGateway_4
	StartNoneEvent_1 --> Task_4
	Task_7 --> ParallelGateway_2
	ExclusiveGateway_1 --> ParallelGateway_5
	ParallelGateway_6 --> Task_7
	Task_22 --> ParallelGateway_5
	ExclusiveGateway_7 --> ExclusiveGateway_1
	Task_10 --> ParallelGateway_5
	ExclusiveGateway_3 --> Task_2
	ExclusiveGateway_8 --> Task_18
	ParallelGateway_1 --> Task_14
	Task_8 --> Task_12
	ParallelGateway_1 --> Task_13
	ExclusiveGateway_6 --> Task_23
	Task_4 --> ParallelGateway_6
	ParallelGateway_1 --> Task_24
	Task_6 --> EndNoneEvent_1
	ExclusiveGateway_6 --> ExclusiveGateway_4
	ParallelGateway_2 --> Task_1
	Task_21 --> Task_3
	ExclusiveGateway_3 --> Task_8
	Task_19 --> ExclusiveGateway_1
	Task_3 --> Task_6
	ExclusiveGateway_2 --> Task_20
	Task_15 --> ExclusiveGateway_6
	Task_18 --> Task_9
	ParallelGateway_3 --> ExclusiveGateway_5
	Task_20 --> ExclusiveGateway_3
	Task_1 --> Task_15
	Task_9 --> ExclusiveGateway_2
	Task_12 --> ExclusiveGateway_2
